ДСУтест/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДСУтест/src/AccumulationRegisters/ОстаткиПоСчетам/ОстаткиПоСчетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоСчетам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУчетн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДСУтест/src/CommonModules/ОбщегоНазначения/Module.bsl
Функция ПолучитьТаблицуАктуальностиКурсов(ДатаКурсов, флгТолькоНеактуальныеКурсы = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Период,
	|	КурсыВалютСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|			&ДатаКурсов, Валюта В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Остатки.Валюта
	|				ИЗ
	|					РегистрНакопления.ОстаткиПоСчетам.Остатки(&ДатаКурсов, Валюта.Используется И Валюта <> &ВалютаУчета) КАК Остатки)
	|			) КАК КурсыВалютСрезПоследних"
	+ ?(флгТолькоНеактуальныеКурсы, " Где КурсыВалютСрезПоследних.Период < НачалоПериода(&ДатаКурсов, День)", "");
	Запрос.УстановитьПараметр("ДатаКурсов", КонецДня(ДатаКурсов));
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ОсновнаяВалютаУчёта.Получить());
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	                                             

Функция КурсыВалютАктуальны(ДатаКурсов) Экспорт 
	
	ТаблицаКурсов = ПолучитьТаблицуАктуальностиКурсов(ДатаКурсов, Истина);
	Возврат ТаблицаКурсов.Количество() = 0;
	
КонецФункции	

Процедура ОбновитьТочкуАктуальности() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ТочкиАктуальностиСрезПоследних.Период) КАК ДатаАктуальности
	               |ПОМЕСТИТЬ ДатыАктуальности
	               |ИЗ
	               |	РегистрСведений.ТочкиАктуальности.СрезПоследних КАК ТочкиАктуальностиСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТочкиАктуальностиСрезПоследних.Период КАК Дата,
	               |	СУММА(ТочкиАктуальностиСрезПоследних.СуммаУчетн) КАК Сумма
	               |ИЗ
	               |	РегистрСведений.ТочкиАктуальности.СрезПоследних КАК ТочкиАктуальностиСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыАктуальности КАК ДатыАктуальности
	               |		ПО ТочкиАктуальностиСрезПоследних.Период = ДатыАктуальности.ДатаАктуальности
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТочкиАктуальностиСрезПоследних.Период";
	ТабЗапрос = Запрос.Выполнить().Выгрузить();			   
	ПараметрыСеанса.ТочкаАктуальности = Новый ФиксированнаяСтруктура("Дата,Сумма", ТабЗапрос[0].Дата, ТабЗапрос[0].Сумма);
	
КонецПроцедуры	

Процедура УстановитьЭлементПользовательскихНастроек(Настройки, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	ВыборкаПараметров = Настройки.Элементы;
	Параметр = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	
	Для Каждого ТекЭлемент Из ВыборкаПараметров Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если ТекЭлемент.Параметр = Параметр Тогда
				ТекЭлемент.Значение = ЗначениеПараметра;
				ТекЭлемент.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЭлементОтбора(Настройки, ИмяПараметра, ЗначениеПараметра, ВидСравнения = Неопределено) Экспорт
	
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;	
	
	ВыборкаПараметров = Настройки.Элементы;
	Параметр = Новый ПолеКомпоновкиДанных(ИмяПараметра);
	
	Для Каждого ТекЭлемент Из ВыборкаПараметров Цикл
		
		Если ТипЗнч(ТекЭлемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		
			Если ТекЭлемент.ЛевоеЗначение = Параметр Тогда
			
				ТекЭлемент.ПравоеЗначение = ЗначениеПараметра;
				ТекЭлемент.ВидСравнения = ВидСравнения;
				ТекЭлемент.Использование = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
